### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.waf.aws_wafv2_web_acl.default has been changed
!   resource "aws_wafv2_web_acl" "default" {
        id          = "15a39f00-d33f-4be1-9c6b-c44b9faff94c"
        name        = "default"
        tags        = {
            "Name" = "default"
        }
        # (6 unchanged attributes hidden)



        # (12 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

──────────────────────────────────────────────────────┲�──────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role.test_role will be destroyed
-   resource "aws_iam_role" "test_role" {
-       arn                   = "arn:aws:iam::220689308637:role/test_role" -> null
-       assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "ec2.amazonaws.com"
                        }
-                       Sid       = ""
                    },
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "lambda.amazonaws.com"
                        }
-                       Sid       = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       create_date           = "2021-12-16T13:49:57Z" -> null
-       force_detach_policies = false -> null
-       id                    = "test_role" -> null
-       managed_policy_arns   = [] -> null
-       max_session_duration  = 3600 -> null
-       name                  = "test_role" -> null
-       path                  = "/" -> null
-       tags                  = {} -> null
-       tags_all              = {} -> null
-       unique_id             = "AROATGYQ3TPOXDVATVVDJ" -> null

-       inline_policy {}
    }

  # aws_vpc.main must be replaced
-/+ resource "aws_vpc" "main" {
!       arn                              = "arn:aws:ec2:ap-northeast-1:220689308637:vpc/vpc-0e49924251c5780dc" -> (known after apply)
-       assign_generated_ipv6_cidr_block = false -> null
!       cidr_block                       = "10.0.0.0/16" -> "10.1.0.0/16" # forces replacement
!       default_network_acl_id           = "acl-0fe75ab14646b517f" -> (known after apply)
!       default_route_table_id           = "rtb-06bbf36b6f3c75bb6" -> (known after apply)
!       default_security_group_id        = "sg-0beaa0605c56aa2b8" -> (known after apply)
!       dhcp_options_id                  = "dopt-be6c7adc" -> (known after apply)
!       enable_classiclink               = false -> (known after apply)
!       enable_classiclink_dns_support   = false -> (known after apply)
!       enable_dns_hostnames             = false -> (known after apply)
!       id                               = "vpc-0e49924251c5780dc" -> (known after apply)
+       ipv6_association_id              = (known after apply)
+       ipv6_cidr_block                  = (known after apply)
!       main_route_table_id              = "rtb-06bbf36b6f3c75bb6" -> (known after apply)
!       owner_id                         = "220689308637" -> (known after apply)
        tags                             = {
            "Name" = "vpc-handson-main"
        }
        # (3 unchanged attributes hidden)
    }

  # module.waf.aws_wafv2_web_acl.default will be destroyed
-   resource "aws_wafv2_web_acl" "default" {
-       arn         = "arn:aws:wafv2:us-east-1:220689308637:global/webacl/default/15a39f00-d33f-4be1-9c6b-c44b9faff94c" -> null
-       capacity    = 1489 -> null
-       description = "WAF acl for Cloudfront" -> null
-       id          = "15a39f00-d33f-4be1-9c6b-c44b9faff94c" -> null
-       lock_token  = "28cfacce-d526-4a94-b246-69b5af521c8a" -> null
-       name        = "default" -> null
-       scope       = "CLOUDFRONT" -> null
-       tags        = {
-           "Name" = "default"
        } -> null
-       tags_all    = {
-           "Name" = "default"
        } -> null

-       default_action {
-           allow {
            }
        }

-       rule {
-           name     = "BodySizeLimitForNormalPagesRule" -> null
-           priority = 8 -> null

-           action {

-               block {
                }
            }

-           statement {
-               and_statement {
-                   statement {

-                       label_match_statement {
-                           key   = "awswaf:managed:aws:core-rule-set:SizeRestrictions_Body" -> null
-                           scope = "LABEL" -> null
                        }
                    }
-                   statement {

-                       not_statement {
-                           statement {

-                               byte_match_statement {
-                                   positional_constraint = "CONTAINS" -> null
-                                   search_string         = "uploader" -> null

-                                   field_to_match {

-                                       uri_path {}
                                    }

-                                   text_transformation {
-                                       priority = 0 -> null
-                                       type     = "NONE" -> null
                                    }
                                }
                            }
                        }
                    }
                }
            }

-           visibility_config {
-               cloudwatch_metrics_enabled = false -> null
-               metric_name                = "BodySizeLimitForNormalPagesRule" -> null
-               sampled_requests_enabled   = true -> null
            }
        }
-       rule {
-           name     = "BodySizeLimitForUploaderPageRule" -> null
-           priority = 9 -> null

-           action {

-               block {
                }
            }

-           statement {

-               size_constraint_statement {
-                   comparison_operator = "GE" -> null
-                   size                = 10000000 -> null

-                   field_to_match {

-                       body {}
                    }

-                   text_transformation {
-                       priority = 0 -> null
-                       type     = "NONE" -> null
                    }
                }
            }

-           visibility_config {
-               cloudwatch_metrics_enabled = false -> null
-               metric_name                = "BodySizeLimitForUploaderPageRule" -> null
-               sampled_requests_enabled   = true -> null
            }
        }
-       rule {
-           name     = "RateLimitRule" -> null
-           priority = 7 -> null

-           action {

-               block {
                }
            }

-           statement {

-               rate_based_statement {
-                   aggregate_key_type = "IP" -> null
-                   limit              = 10000 -> null
                }
            }

-           visibility_config {
-               cloudwatch_metrics_enabled = false -> null
-               metric_name                = "RateLimitRule" -> null
-               sampled_requests_enabled   = true -> null
            }
        }
-       rule {
-           name     = "AWSManagedRulesAmazonIpReputationList" -> null
-           priority = 3 -> null

-           override_action {

-               none {}
            }

-           statement {

-               managed_rule_group_statement {
-                   name        = "AWSManagedRulesAmazonIpReputationList" -> null
-                   vendor_name = "AWS" -> null
                }
            }

-           visibility_config {
-               cloudwatch_metrics_enabled = false -> null
-               metric_name                = "AWSManagedRulesAmazonIpReputationList" -> null
-               sampled_requests_enabled   = true -> null
            }
        }
-       rule {
-           name     = "AWSManagedRulesAnonymousIpList" -> null
-           priority = 4 -> null

-           override_action {

-               none {}
            }

-           statement {

-               managed_rule_group_statement {
-                   name        = "AWSManagedRulesAnonymousIpList" -> null
-                   vendor_name = "AWS" -> null
                }
            }

-           visibility_config {
-               cloudwatch_metrics_enabled = false -> null
-               metric_name                = "AWSManagedRulesAnonymousIpList" -> null
-               sampled_requests_enabled   = true -> null
            }
        }
-       rule {
-           name     = "AWSManagedRulesCommonRuleSet" -> null
-           priority = 0 -> null

-           override_action {

-               none {}
            }

-           statement {

-               managed_rule_group_statement {
-                   name        = "AWSManagedRulesCommonRuleSet" -> null
-                   vendor_name = "AWS" -> null

-                   excluded_rule {
-                       name = "SizeRestrictions_BODY" -> null
                    }
                }
            }

-           visibility_config {
-               cloudwatch_metrics_enabled = false -> null
-               metric_name                = "AWSManagedRulesCommonRuleSet" -> null
-               sampled_requests_enabled   = true -> null
            }
        }
-       rule {
-           name     = "AWSManagedRulesKnownBadInputsRuleSet" -> null
-           priority = 2 -> null

-           override_action {

-               none {}
            }

-           statement {

-               managed_rule_group_statement {
-                   name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
-                   vendor_name = "AWS" -> null
                }
            }

-           visibility_config {
-               cloudwatch_metrics_enabled = false -> null
-               metric_name                = "AWSManagedRulesKnownBadInputsRuleSet" -> null
-               sampled_requests_enabled   = true -> null
            }
        }
-       rule {
-           name     = "AWSManagedRulesLinuxRuleSet" -> null
-           priority = 6 -> null

-           override_action {

-               none {}
            }

-           statement {

-               managed_rule_group_statement {
-                   name        = "AWSManagedRulesLinuxRuleSet" -> null
-                   vendor_name = "AWS" -> null
                }
            }

-           visibility_config {
-               cloudwatch_metrics_enabled = false -> null
-               metric_name                = "AWSManagedRulesLinuxRuleSet" -> null
-               sampled_requests_enabled   = true -> null
            }
        }
-       rule {
-           name     = "AWSManagedRulesSQLiRuleSet" -> null
-           priority = 1 -> null

-           override_action {

-               none {}
            }

-           statement {

-               managed_rule_group_statement {
-                   name        = "AWSManagedRulesSQLiRuleSet" -> null
-                   vendor_name = "AWS" -> null
                }
            }

-           visibility_config {
-               cloudwatch_metrics_enabled = false -> null
-               metric_name                = "AWSManagedRulesSQLiRuleSet" -> null
-               sampled_requests_enabled   = true -> null
            }
        }
-       rule {
-           name     = "AWSManagedRulesUnixRuleSet" -> null
-           priority = 5 -> null

-           override_action {

-               none {}
            }

-           statement {

-               managed_rule_group_statement {
-                   name        = "AWSManagedRulesUnixRuleSet" -> null
-                   vendor_name = "AWS" -> null
                }
            }

-           visibility_config {
-               cloudwatch_metrics_enabled = false -> null
-               metric_name                = "AWSManagedRulesUnixRuleSet" -> null
-               sampled_requests_enabled   = true -> null
            }
        }

-       visibility_config {
-           cloudwatch_metrics_enabled = false -> null
-           metric_name                = "aws_wafv2_web_acl_default" -> null
-           sampled_requests_enabled   = true -> null
        }
    }

Plan: 1 to add, 0 to change, 3 to destroy.
```
</details>